app/Validation/StudentRules.php

  public function validateStudent(string $str, string $fields, array $data){
    $model = new StudentModel();
    $user = $model->where('email', $data['email'])
                  ->first();
---
SELECT *
FROM `student`
WHERE `email` = 'qojyd@mailinator.com'
 LIMIT 1