app/Validation/UserRules.php

  public function validateUser(string $str, string $fields, array $data){
    $model = new AdminModel();
    $user = $model->where('email', $data['email'])
                  ->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'jbareta2@gmail.com'
 LIMIT 1