app/Controllers/Home.php

SELECT *
FROM `faculty`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `faculty`
---
    public function faculty()
    {
        $model = new FacultyModel();
        helper('text');
        helper(['form']);
        $data = [
            'faculties' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `admin`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `admin`
---
    public function admin()
    {
        // /$data['user']=$adminModel->where("superadmin.id", session("id"))->first();
        $model = new AdminModel();
        helper('text');
        helper(['form']);
        $data = [
            'admin' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `student`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `student`
---
    public function sendemail()
    {
        $db = db_connect();
        $model = new StudentModel($db);
        //$customModel = new CustomModel($db);
        $courseModel = new CourseModel($db);
        helper('text');
        helper(['form']);


        $data = [
            'student' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `student`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `student`
---
    public function student()
    {
        $db = db_connect();
        $model = new StudentModel($db);
        //$customModel = new CustomModel($db);
        $courseModel = new CourseModel($db);
        helper('text');
        helper(['form']);


        $data = [
            'student' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `subject`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `subject`
---
    public function subject()
    {
        $model = new SubjectModel();
        helper('text');
        helper(['form']);
        $data = [
            'subject' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `course`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `course`
---
    public function course()
    {
        $model = new CourseModel();
        helper('text');
        helper(['form']);
        $data = [
            'course' => $model->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `academic_year`
WHERE `academic_year`.`id` = '4'
SELECT *
FROM `question`
WHERE `question`.`academic_id` = '4'
SELECT *
FROM `question`
WHERE `question`.`id` IS NULL
---
    public function managequestion($id){
        $model = new AcademicModel();
        $db = db_connect();
        $questionModel = new QuestionModel();
        helper(['form']);

        //$data['questions'] = $questionModel->find();
        $data['academicyear'] =$model->find($id);

        $questions=$questionModel->where("question.academic_id",$id)->get()->getResultArray();

        $data['questions'] =$questions;

        // $builder = $db->table('question');        // 'mytablename' is the name of your table

        // $builder->select('input_type', 'id');       // names of your columns
        // $builder->where('id', '*');                // where clause
        // $query = $builder->get()->getResult();
        //$dd=$query;



        $data['ss'] =$questionModel->where("question.id")->get()->getResultArray();

SELECT *
FROM `superadmin`
WHERE `superadmin`.`id` = '6'
 LIMIT 1
---
    public function profiwle(){
        $db = db_connect();

        helper('form', 'url');
        $adminModel = new UserModel($db);
        $data['user']=$adminModel->where("superadmin.id", session("id"))->first();

SELECT *
FROM `admin`
WHERE `admin`.`id` = '40'
 LIMIT 1
SELECT *
FROM `superadmin`
WHERE `superadmin`.`id` = '6'
 LIMIT 1
---
    public function profile()
    {
        $db = db_connect();
        //$model = new StudentModel($db);
        //$customModel = new CustomModel($db);
        $courseModel = new CourseModel($db);
        helper('text');
        helper(['form']);
        $adminModel = new UserModel($db);
        $data['user']=$adminModel->where("superadmin.id", session("id"))->first();