app/Controllers/Home.php

    public function StudentEvaluation()
    {
        $model = new AcademicModel();
        $db = db_connect();
        $questionModel = new QuestionModel();
        helper(['form']);
        $coursemodel = new CourseModel();
        $subjectmodel = new SubjectModel();
        $facultymodel = new FacultyModel();
        $criteriamodel = new CriteriaModel();
        $restrictionmodel = new RestrictionModel();
        $data['course']=$coursemodel->find();
        $data['subject']=$subjectmodel->find();
        $data['faculty']=$facultymodel->find();
        $data['criteria']=$criteriamodel->find();
        $data['restriction']=$restrictionmodel->find();
        //$data['questions'] = $questionModel->find();
        //$data['academicyear'] =$model->find($id);
       //$s['criterias'] = $criteriamodel->where('criteria.id')->join('question', 'question.criteria_id = criteria.id')->get()->getResult();



        $builder = $db->table('criteria');
        $builder->select('*');
        $builder->join('question', 'question.criteria_id = criteria.id');
        $data['criteria1'] = $builder->get()->getResultArray();
---
SELECT *
FROM `course`
SELECT *
FROM `subject`
SELECT *
FROM `faculty`
SELECT *
FROM `criteria`
SELECT *
FROM `restrictions`
SELECT *
FROM `criteria`
JOIN `question` ON `question`.`criteria_id` = `criteria`.`id`

        // $questions=$questionModel->where($multiClause)->get()->getResultArray();
        // $data['questions'] =$questions;

        $questions=$questionModel->where("question.academic_id",10)->get()->getResultArray();

        $data['questions'] =$questions;
        $data['questions1']=$questionModel->where("question.academic_id",10)->get()->getResultArray();
---
SELECT *
FROM `question`
WHERE `question`.`academic_id` = 10




        $data['ss'] =$questionModel->where("question.id")->get()->getResultArray();
---
SELECT *
FROM `question`
WHERE `question`.`id` IS NULL




        $data['ss'] =$questionModel->where("question.id")->get()->getResultArray();
---
SELECT *
FROM `question`
WHERE `question`.`id` IS NULL

    public function admin()
    {
        // /$data['user']=$adminModel->where("superadmin.id", session("id"))->first();
        $model = new AdminModel();
        helper('text');
        helper(['form']);
        $data = [
            'admin' => $model->paginate(10),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `admin`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `admin`

    public function sendemail()
    {
        $db = db_connect();
        $model = new StudentModel($db);
        //$customModel = new CustomModel($db);
        $courseModel = new CourseModel($db);
        helper('text');
        helper(['form']);


        $data = [
            'student' => $model->paginate(10),
            'pager' => $model->pager,
        ];
        $data['studmail'] = $model->find();
---
SELECT COUNT(*) AS `numrows`
FROM `student`
SELECT *
FROM `student`
 LIMIT 10

    public function course()
    {
        $model = new CourseModel();
        helper('text');
        helper(['form']);
        $data = [
            'course' => $model->paginate(10),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `course`

    public function academicyear()
    {
        $model = new AcademicModel();
        helper('text');
        helper(['form']);
        $data = [
            'academicyear' => $model->paginate(10),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `academic_year`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `academic_year`

    public function questions()
    {
        $model = new AcademicModel();
        $questionModel = new QuestionModel();
        helper('text');
        helper(['form']);
        $data = [
            'academicyear' => $model->paginate(10),
            'pager' => $model->pager,
        ];

        $academic = $model->find();
---
SELECT *
FROM `academic_year`
WHERE `academic_year`.`id` = '11'

    public function profile()
    {
        $db = db_connect();
        //$model = new StudentModel($db);
        //$customModel = new CustomModel($db);
        $courseModel = new CourseModel($db);
        helper('text');
        helper(['form']);
        $adminModel = new AdminModel($db);
        $data['user']=$adminModel->where("admin.id", session("id"))->first();
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '44'
 LIMIT 1