app/Controllers/Login.php

    public function studauth(){
        $session = session();
        $model = new StudentModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        helper(['form']);
		$data = [];
		helper(['form']);


		if($this->request->getMethod()=='post'){
            $rules = [

                'email'=>'required|min_length[1]|max_length[255]|valid_email',
                'password'=>'required|min_length[1]|max_length[255]|validateStudent[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateStudent' => 'Email/Password Does not Match'
                ]
            ];
            //$this->validate($rules,$errors)
            if($this->validate($rules,$errors)){
                $data = $model->where('email', $email)->first();
                $data['user']=$model->where("student.id", session("id"))->first();
---
SELECT *
FROM `student`
WHERE `email` = 'qojyd@mailinator.com'
 LIMIT 1
SELECT *
FROM `student`
WHERE `student`.`id` IS NULL
 LIMIT 1