app/Controllers/Login.php

    public function auth(){
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
       //include helper form
        helper(['form']);
		$data = [];
		helper(['form']);


		if($this->request->getMethod()=='post'){
            $rules = [

                'email'=>'required|min_length[3]|max_length[30]|valid_email',
                'password'=>'required|min_length[3]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => 'Email/Password Does not Match'
                ]
            ];

            if($this->validate($rules,$errors)){
                $data = $model->where('email', $email)->first();
                $data['user']=$model->where("superadmin.id", session("id"))->first();
---
SELECT *
FROM `superadmin`
WHERE `superadmin`.`id` IS NULL
 LIMIT 1