app/Controllers/Subject.php

SELECT *
FROM `subject`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `subject`
---
    public function save()
    {
        //include helper form
        helper(['form']);
        //set rules validation form
        $rules = [
            'subject_code'          => 'required|min_length[3]|max_length[255]',
            'subject'          => 'required|min_length[3]|max_length[255]',
            'description'          => 'required|min_length[3]|max_length[255]'
        ];

        if($this->validate($rules)){
            $model = new SubjectModel();
            $data = [
                'subject_code'     => $this->request->getVar('subject_code'),
                'subject'     => $this->request->getVar('subject'),
                'description'     => $this->request->getVar('description'),
            ];
            $model->save($data);
            return redirect()->to('/Home/subject');
        }else{
            $data['validation'] = $this->validator;
            $model = new SubjectModel();
            helper(['form']);
            $data = [
                'subject' => $model->paginate(10),
                'pager' => $model->pager,
            ];